---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.FarDistance
source: html/3126882b-4f3b-e39a-5f0a-e0977b240567.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.FarDistance Property

Distance to far clipping plane

## Syntax (C#)
```csharp
public double FarDistance { get; set; }
```